src/services/api/app/controllers/recipe_items_controller.rb

  def index
    recipe_items = current_user.recipes.includes(recipe_items: :ingredient).find(params[:recipe_id]).recipe_items
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_item_id" IN ($1, $2, $3)  [["recipe_item_id", 1], ["recipe_item_id", 2], ["recipe_item_id", 3]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "recipe_items".* FROM "recipe_items" WHERE "recipe_items"."recipe_id" = $1  [["recipe_id", 1]]